"use strict";
//Задача. Получить от пользователя два числа и вывести в диалоговое окно 
// результат сложения этих чисел

// const num = Number.parseFloat(prompt("Введите число А"));
// const num2 = Number.parseFloat(prompt("Введите число Б"));
// printAlert(num, num2);

// function sum(a, b){
//     return a + b;
// }
// // alert(`Результат сложения чисел ${num} и ${num2} равен ${num + num2}`);

// function printAlert(n, m){
//     alert(`Результат сложения чисел ${n} и ${m} равен ${sum(n, m)}`);
// }

//Задача2. Написать функцию, которая принимает имя пользователя при ее вызове 
// и выводит сообщение с приветствием пользователя по имени.

// function printName(name){
//     alert(`Привет, ${name}`);
// }
// printName(prompt("Введите имя"));

//Задача3. Вывести на экран в диалоговом окне текст с сообщением "Вам хорошо
// живется?" и кнопками "Ок" и "Отмена", для чего необходимо использовать 
//confirm.
// При нажатии на кнопку "Ок" вывести в диалоговом окне текст с сообщением 
// "Тогда мы идем к вам!"
// При нажатии кнопки "Отмена" вывести в диалоговом окне текст с сообщением
// "Ну вы держитесь там!"
// const result = confirm("Вам хорошо живется?");

// if (result) {
//     alert("Тогда мы идем к вам!");
// } else {
//     alert("Ну вы держитесь там!");
// }
// Задача 4. Перепишите код с использованием switch-case
// let age = 18;
// switch (age) {
//     case 18:
//         alert("Вы совершеннолетний, все можно!");
//         break;
//     case 10:
//         alert("Вам надо учить уроки!");
//         break;
//     case 30:
//         alert("Ложитесь спать, завтра на работу!");
//         break;
//     default:
//         alert("Мы не знаем, что вам делать");
// }
